espressif/esp-idf/components/soc/esp32s2/include/soc/rmt_reg.h
/*
 * SPDX-FileCopyrightText: 2017-2022 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include "soc.h"

#ifdef __cplusplus
extern "C" {
#endif

/** RMT_CH0DATA_REG register
 *  Read and write data for channel 0 via APB FIFO
 */
#define RMT_CH0DATA_REG (DR_REG_RMT_BASE + 0x0)
/** RMT_CH0_DATA : RO; bitpos: [31:0]; default: 0;
 *  This register is used to read and write data for channel 0 via APB FIFO.
 */
#define RMT_CH0_DATA    0xFFFFFFFFU
#define RMT_CH0_DATA_M  (RMT_CH0_DATA_V << RMT_CH0_DATA_S)
#define RMT_CH0_DATA_V  0xFFFFFFFFU
#define RMT_CH0_DATA_S  0

/** RMT_CH1DATA_REG register
 *  Read and write data for channel 1 via APB FIFO
 */
#define RMT_CH1DATA_REG (DR_REG_RMT_BASE + 0x4)
/** RMT_CH0_DATA : RO; bitpos: [31:0]; default: 0;
 *  This register is used to read and write data for channel 1 via APB FIFO.
 */
#define RMT_CH0_DATA    0xFFFFFFFFU
#define RMT_CH0_DATA_M  (RMT_CH0_DATA_V << RMT_CH0_DATA_S)
#define RMT_CH0_DATA_V  0xFFFFFFFFU
#define RMT_CH0_DATA_S  0

/** RMT_CH2DATA_REG register
 *  Read and write data for channel 2 via APB FIFO
 */
#define RMT_CH2DATA_REG (DR_REG_RMT_BASE + 0x8)
/** RMT_CH0_DATA : RO; bitpos: [31:0]; default: 0;
 *  This register is used to read and write data for channel 2 via APB FIFO.
 */
#define RMT_CH0_DATA    0xFFFFFFFFU
#define RMT_CH0_DATA_M  (RMT_CH0_DATA_V << RMT_CH0_DATA_S)
#define RMT_CH0_DATA_V  0xFFFFFFFFU
#define RMT_CH0_DATA_S  0

/** RMT_CH3DATA_REG register
 *  Read and write data for channel 3 via APB FIFO
 */
#define RMT_CH3DATA_REG (DR_REG_RMT_BASE + 0xc)
/** RMT_CH0_DATA : RO; bitpos: [31:0]; default: 0;
 *  This register is used to read and write data for channel 3 via APB FIFO.
 */
#define RMT_CH0_DATA    0xFFFFFFFFU
#define RMT_CH0_DATA_M  (RMT_CH0_DATA_V << RMT_CH0_DATA_S)
#define RMT_CH0_DATA_V  0xFFFFFFFFU
#define RMT_CH0_DATA_S  0

/** RMT_CH0CONF0_REG register
 *  Channel 0 configuration register 0
 */
#define RMT_CH0CONF0_REG (DR_REG_RMT_BASE + 0x10)
/** RMT_DIV_CNT_CH0 : R/W; bitpos: [7:0]; default: 2;
 *  This field is used to configure clock divider for channel 0.
 */
#define RMT_DIV_CNT_CH0    0x000000FFU
#define RMT_DIV_CNT_CH0_M  (RMT_DIV_CNT_CH0_V << RMT_DIV_CNT_CH0_S)
#define RMT_DIV_CNT_CH0_V  0x000000FFU
#define RMT_DIV_CNT_CH0_S  0
/** RMT_IDLE_THRES_CH0 : R/W; bitpos: [23:8]; default: 4096;
 *  Receiving ends when no edge is detected on input signals for continuous clock
 *  cycles longer than this field value.
 */
#define RMT_IDLE_THRES_CH0    0x0000FFFFU
#define RMT_IDLE_THRES_CH0_M  (RMT_IDLE_THRES_CH0_V << RMT_IDLE_THRES_CH0_S)
#define RMT_IDLE_THRES_CH0_V  0x0000FFFFU
#define RMT_IDLE_THRES_CH0_S  8
/** RMT_MEM_SIZE_CH0 : R/W; bitpos: [26:24]; default: 1;
 *  This field is used to configure the maximum blocks allocated to channel 0. The
 *  valid range is from 1 ~ 4-0.
 */
#define RMT_MEM_SIZE_CH0    0x00000007U
#define RMT_MEM_SIZE_CH0_M  (RMT_MEM_SIZE_CH0_V << RMT_MEM_SIZE_CH0_S)
#define RMT_MEM_SIZE_CH0_V  0x00000007U
#define RMT_MEM_SIZE_CH0_S  24
/** RMT_CARRIER_EFF_EN_CH0 : R/W; bitpos: [27]; default: 1;
 *  1: Add carrier modulation on output signals only at data sending state for channel
 *  0. 0: Add carrier modulation on signals at all states for channel 0. States here
 *  include idle state (ST_IDLE), reading data from RAM (ST_RD_MEM), and sending data
 *  stored in RAM (ST_SEND). Only valid when RMT_CARRIER_EN_CH0 is set to 1.
 */
#define RMT_CARRIER_EFF_EN_CH0    (BIT(27))
#define RMT_CARRIER_EFF_EN_CH0_M  (RMT_CARRIER_EFF_EN_CH0_V << RMT_CARRIER_EFF_EN_CH0_S)
#define RMT_CARRIER_EFF_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EFF_EN_CH0_S  27
/** RMT_CARRIER_EN_CH0 : R/W; bitpos: [28]; default: 1;
 *  This bit is used to enable carrier modulation for channel 0. 1: Add carrier
 *  modulation on output signals. 0: No carrier modulation is added on output signals.
 */
#define RMT_CARRIER_EN_CH0    (BIT(28))
#define RMT_CARRIER_EN_CH0_M  (RMT_CARRIER_EN_CH0_V << RMT_CARRIER_EN_CH0_S)
#define RMT_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EN_CH0_S  28
/** RMT_CARRIER_OUT_LV_CH0 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for channel 0.
 *
 *  1'h0: Add carrier wave on low-level output signals.
 *
 *  1'h1: Add carrier wave on high-level output signals.
 */
#define RMT_CARRIER_OUT_LV_CH0    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH0_M  (RMT_CARRIER_OUT_LV_CH0_V << RMT_CARRIER_OUT_LV_CH0_S)
#define RMT_CARRIER_OUT_LV_CH0_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH0_S  29

/** RMT_CH0CONF1_REG register
 *  Channel 0 configuration register 1
 */
#define RMT_CH0CONF1_REG (DR_REG_RMT_BASE + 0x14)
/** RMT_TX_START_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on channel 0.
 */
#define RMT_TX_START_CH0    (BIT(0))
#define RMT_TX_START_CH0_M  (RMT_TX_START_CH0_V << RMT_TX_START_CH0_S)
#define RMT_TX_START_CH0_V  0x00000001U
#define RMT_TX_START_CH0_S  0
/** RMT_RX_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable receiver to receive data on channel 0.
 */
#define RMT_RX_EN_CH0    (BIT(1))
#define RMT_RX_EN_CH0_M  (RMT_RX_EN_CH0_V << RMT_RX_EN_CH0_S)
#define RMT_RX_EN_CH0_V  0x00000001U
#define RMT_RX_EN_CH0_S  1
/** RMT_MEM_WR_RST_CH0 : WO; bitpos: [2]; default: 0;
 *  Set this bit to reset RAM write address accessed by the receiver for channel 0.
 */
#define RMT_MEM_WR_RST_CH0    (BIT(2))
#define RMT_MEM_WR_RST_CH0_M  (RMT_MEM_WR_RST_CH0_V << RMT_MEM_WR_RST_CH0_S)
#define RMT_MEM_WR_RST_CH0_V  0x00000001U
#define RMT_MEM_WR_RST_CH0_S  2
/** RMT_MEM_RD_RST_CH0 : WO; bitpos: [3]; default: 0;
 *  Set this bit to reset RAM read address accessed by the transmitter for channel 0.
 */
#define RMT_MEM_RD_RST_CH0    (BIT(3))
#define RMT_MEM_RD_RST_CH0_M  (RMT_MEM_RD_RST_CH0_V << RMT_MEM_RD_RST_CH0_S)
#define RMT_MEM_RD_RST_CH0_V  0x00000001U
#define RMT_MEM_RD_RST_CH0_S  3
/** RMT_APB_MEM_RST_CH0 : WO; bitpos: [4]; default: 0;
 *  Set this bit to reset W/R ram address for channel 0 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH0    (BIT(4))
#define RMT_APB_MEM_RST_CH0_M  (RMT_APB_MEM_RST_CH0_V << RMT_APB_MEM_RST_CH0_S)
#define RMT_APB_MEM_RST_CH0_V  0x00000001U
#define RMT_APB_MEM_RST_CH0_S  4
/** RMT_MEM_OWNER_CH0 : R/W; bitpos: [5]; default: 1;
 *  This bit marks the ownership of channel 0's RAM block.
 *
 *  1'h1: Receiver is using the RAM.
 *
 *  1'h0: Transmitter is using the RAM.
 */
#define RMT_MEM_OWNER_CH0    (BIT(5))
#define RMT_MEM_OWNER_CH0_M  (RMT_MEM_OWNER_CH0_V << RMT_MEM_OWNER_CH0_S)
#define RMT_MEM_OWNER_CH0_V  0x00000001U
#define RMT_MEM_OWNER_CH0_S  5
/** RMT_TX_CONTI_MODE_CH0 : R/W; bitpos: [6]; default: 0;
 *  Set this bit to restart transmission in continuous node from the first data in
 *  channel 0.
 */
#define RMT_TX_CONTI_MODE_CH0    (BIT(6))
#define RMT_TX_CONTI_MODE_CH0_M  (RMT_TX_CONTI_MODE_CH0_V << RMT_TX_CONTI_MODE_CH0_S)
#define RMT_TX_CONTI_MODE_CH0_V  0x00000001U
#define RMT_TX_CONTI_MODE_CH0_S  6
/** RMT_RX_FILTER_EN_CH0 : R/W; bitpos: [7]; default: 0;
 *  Set this bit to enable the receiver's filter for channel 0.
 */
#define RMT_RX_FILTER_EN_CH0    (BIT(7))
#define RMT_RX_FILTER_EN_CH0_M  (RMT_RX_FILTER_EN_CH0_V << RMT_RX_FILTER_EN_CH0_S)
#define RMT_RX_FILTER_EN_CH0_V  0x00000001U
#define RMT_RX_FILTER_EN_CH0_S  7
/** RMT_RX_FILTER_THRES_CH0 : R/W; bitpos: [15:8]; default: 15;
 *  Set this field to ignore the input pulse when its width is less than
 *  RMT_RX_FILTER_THRES_CH0 APB clock cycles in receive mode.
 */
#define RMT_RX_FILTER_THRES_CH0    0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_M  (RMT_RX_FILTER_THRES_CH0_V << RMT_RX_FILTER_THRES_CH0_S)
#define RMT_RX_FILTER_THRES_CH0_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_S  8
/** RMT_CHK_RX_CARRIER_EN_CH0 : R/W; bitpos: [16]; default: 0;
 *  Set this bit to enable memory loop read mode when carrier modulation is enabled for
 *  channel 0.
 */
#define RMT_CHK_RX_CARRIER_EN_CH0    (BIT(16))
#define RMT_CHK_RX_CARRIER_EN_CH0_M  (RMT_CHK_RX_CARRIER_EN_CH0_V << RMT_CHK_RX_CARRIER_EN_CH0_S)
#define RMT_CHK_RX_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CHK_RX_CARRIER_EN_CH0_S  16
/** RMT_REF_ALWAYS_ON_CH0 : R/W; bitpos: [17]; default: 0;
 *  Set this bit to select a base clock for channel 0.
 *
 *  1'h1: APB_CLK    1'h0: REF_TICK
 */
#define RMT_REF_ALWAYS_ON_CH0    (BIT(17))
#define RMT_REF_ALWAYS_ON_CH0_M  (RMT_REF_ALWAYS_ON_CH0_V << RMT_REF_ALWAYS_ON_CH0_S)
#define RMT_REF_ALWAYS_ON_CH0_V  0x00000001U
#define RMT_REF_ALWAYS_ON_CH0_S  17
/** RMT_IDLE_OUT_LV_CH0 : R/W; bitpos: [18]; default: 0;
 *  This bit configures the level of output signals in channel 0 when the transmitter
 *  is in idle state.
 */
#define RMT_IDLE_OUT_LV_CH0    (BIT(18))
#define RMT_IDLE_OUT_LV_CH0_M  (RMT_IDLE_OUT_LV_CH0_V << RMT_IDLE_OUT_LV_CH0_S)
#define RMT_IDLE_OUT_LV_CH0_V  0x00000001U
#define RMT_IDLE_OUT_LV_CH0_S  18
/** RMT_IDLE_OUT_EN_CH0 : R/W; bitpos: [19]; default: 0;
 *  This is the output enable bit for channel 0 in idle state.
 */
#define RMT_IDLE_OUT_EN_CH0    (BIT(19))
#define RMT_IDLE_OUT_EN_CH0_M  (RMT_IDLE_OUT_EN_CH0_V << RMT_IDLE_OUT_EN_CH0_S)
#define RMT_IDLE_OUT_EN_CH0_V  0x00000001U
#define RMT_IDLE_OUT_EN_CH0_S  19
/** RMT_TX_STOP_CH0 : R/W; bitpos: [20]; default: 0;
 *  Set this bit to stop the transmitter of channel 0 sending data out.
 */
#define RMT_TX_STOP_CH0    (BIT(20))
#define RMT_TX_STOP_CH0_M  (RMT_TX_STOP_CH0_V << RMT_TX_STOP_CH0_S)
#define RMT_TX_STOP_CH0_V  0x00000001U
#define RMT_TX_STOP_CH0_S  20

/** RMT_CH1CONF0_REG register
 *  Channel 1 configuration register 0
 */
#define RMT_CH1CONF0_REG (DR_REG_RMT_BASE + 0x18)
/** RMT_DIV_CNT_CH0 : R/W; bitpos: [7:0]; default: 2;
 *  This field is used to configure clock divider for channel 1.
 */
#define RMT_DIV_CNT_CH0    0x000000FFU
#define RMT_DIV_CNT_CH0_M  (RMT_DIV_CNT_CH0_V << RMT_DIV_CNT_CH0_S)
#define RMT_DIV_CNT_CH0_V  0x000000FFU
#define RMT_DIV_CNT_CH0_S  0
/** RMT_IDLE_THRES_CH0 : R/W; bitpos: [23:8]; default: 4096;
 *  Receiving ends when no edge is detected on input signals for continuous clock
 *  cycles longer than this field value.
 */
#define RMT_IDLE_THRES_CH0    0x0000FFFFU
#define RMT_IDLE_THRES_CH0_M  (RMT_IDLE_THRES_CH0_V << RMT_IDLE_THRES_CH0_S)
#define RMT_IDLE_THRES_CH0_V  0x0000FFFFU
#define RMT_IDLE_THRES_CH0_S  8
/** RMT_MEM_SIZE_CH0 : R/W; bitpos: [26:24]; default: 1;
 *  This field is used to configure the maximum blocks allocated to channel 1. The
 *  valid range is from 1 ~ 4-1.
 */
#define RMT_MEM_SIZE_CH0    0x00000007U
#define RMT_MEM_SIZE_CH0_M  (RMT_MEM_SIZE_CH0_V << RMT_MEM_SIZE_CH0_S)
#define RMT_MEM_SIZE_CH0_V  0x00000007U
#define RMT_MEM_SIZE_CH0_S  24
/** RMT_CARRIER_EFF_EN_CH0 : R/W; bitpos: [27]; default: 1;
 *  1: Add carrier modulation on output signals only at data sending state for channel
 *  1. 0: Add carrier modulation on signals at all states for channel 1. States here
 *  include idle state (ST_IDLE), reading data from RAM (ST_RD_MEM), and sending data
 *  stored in RAM (ST_SEND). Only valid when RMT_CARRIER_EN_CH1 is set to 1.
 */
#define RMT_CARRIER_EFF_EN_CH0    (BIT(27))
#define RMT_CARRIER_EFF_EN_CH0_M  (RMT_CARRIER_EFF_EN_CH0_V << RMT_CARRIER_EFF_EN_CH0_S)
#define RMT_CARRIER_EFF_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EFF_EN_CH0_S  27
/** RMT_CARRIER_EN_CH0 : R/W; bitpos: [28]; default: 1;
 *  This bit is used to enable carrier modulation for channel 1. 1: Add carrier
 *  modulation on output signals. 0: No carrier modulation is added on output signals.
 */
#define RMT_CARRIER_EN_CH0    (BIT(28))
#define RMT_CARRIER_EN_CH0_M  (RMT_CARRIER_EN_CH0_V << RMT_CARRIER_EN_CH0_S)
#define RMT_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EN_CH0_S  28
/** RMT_CARRIER_OUT_LV_CH0 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for channel 1.
 *
 *  1'h0: Add carrier wave on low-level output signals.
 *
 *  1'h1: Add carrier wave on high-level output signals.
 */
#define RMT_CARRIER_OUT_LV_CH0    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH0_M  (RMT_CARRIER_OUT_LV_CH0_V << RMT_CARRIER_OUT_LV_CH0_S)
#define RMT_CARRIER_OUT_LV_CH0_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH0_S  29

/** RMT_CH1CONF1_REG register
 *  Channel 1 configuration register 1
 */
#define RMT_CH1CONF1_REG (DR_REG_RMT_BASE + 0x1c)
/** RMT_TX_START_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on channel 1.
 */
#define RMT_TX_START_CH0    (BIT(0))
#define RMT_TX_START_CH0_M  (RMT_TX_START_CH0_V << RMT_TX_START_CH0_S)
#define RMT_TX_START_CH0_V  0x00000001U
#define RMT_TX_START_CH0_S  0
/** RMT_RX_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable receiver to receive data on channel 1.
 */
#define RMT_RX_EN_CH0    (BIT(1))
#define RMT_RX_EN_CH0_M  (RMT_RX_EN_CH0_V << RMT_RX_EN_CH0_S)
#define RMT_RX_EN_CH0_V  0x00000001U
#define RMT_RX_EN_CH0_S  1
/** RMT_MEM_WR_RST_CH0 : WO; bitpos: [2]; default: 0;
 *  Set this bit to reset RAM write address accessed by the receiver for channel 1.
 */
#define RMT_MEM_WR_RST_CH0    (BIT(2))
#define RMT_MEM_WR_RST_CH0_M  (RMT_MEM_WR_RST_CH0_V << RMT_MEM_WR_RST_CH0_S)
#define RMT_MEM_WR_RST_CH0_V  0x00000001U
#define RMT_MEM_WR_RST_CH0_S  2
/** RMT_MEM_RD_RST_CH0 : WO; bitpos: [3]; default: 0;
 *  Set this bit to reset RAM read address accessed by the transmitter for channel 1.
 */
#define RMT_MEM_RD_RST_CH0    (BIT(3))
#define RMT_MEM_RD_RST_CH0_M  (RMT_MEM_RD_RST_CH0_V << RMT_MEM_RD_RST_CH0_S)
#define RMT_MEM_RD_RST_CH0_V  0x00000001U
#define RMT_MEM_RD_RST_CH0_S  3
/** RMT_APB_MEM_RST_CH0 : WO; bitpos: [4]; default: 0;
 *  Set this bit to reset W/R ram address for channel 1 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH0    (BIT(4))
#define RMT_APB_MEM_RST_CH0_M  (RMT_APB_MEM_RST_CH0_V << RMT_APB_MEM_RST_CH0_S)
#define RMT_APB_MEM_RST_CH0_V  0x00000001U
#define RMT_APB_MEM_RST_CH0_S  4
/** RMT_MEM_OWNER_CH0 : R/W; bitpos: [5]; default: 1;
 *  This bit marks the ownership of channel 1's RAM block.
 *
 *  1'h1: Receiver is using the RAM.
 *
 *  1'h0: Transmitter is using the RAM.
 */
#define RMT_MEM_OWNER_CH0    (BIT(5))
#define RMT_MEM_OWNER_CH0_M  (RMT_MEM_OWNER_CH0_V << RMT_MEM_OWNER_CH0_S)
#define RMT_MEM_OWNER_CH0_V  0x00000001U
#define RMT_MEM_OWNER_CH0_S  5
/** RMT_TX_CONTI_MODE_CH0 : R/W; bitpos: [6]; default: 0;
 *  Set this bit to restart transmission in continuous node from the first data in
 *  channel 1.
 */
#define RMT_TX_CONTI_MODE_CH0    (BIT(6))
#define RMT_TX_CONTI_MODE_CH0_M  (RMT_TX_CONTI_MODE_CH0_V << RMT_TX_CONTI_MODE_CH0_S)
#define RMT_TX_CONTI_MODE_CH0_V  0x00000001U
#define RMT_TX_CONTI_MODE_CH0_S  6
/** RMT_RX_FILTER_EN_CH0 : R/W; bitpos: [7]; default: 0;
 *  Set this bit to enable the receiver's filter for channel 1.
 */
#define RMT_RX_FILTER_EN_CH0    (BIT(7))
#define RMT_RX_FILTER_EN_CH0_M  (RMT_RX_FILTER_EN_CH0_V << RMT_RX_FILTER_EN_CH0_S)
#define RMT_RX_FILTER_EN_CH0_V  0x00000001U
#define RMT_RX_FILTER_EN_CH0_S  7
/** RMT_RX_FILTER_THRES_CH0 : R/W; bitpos: [15:8]; default: 15;
 *  Set this field to ignore the input pulse when its width is less than
 *  RMT_RX_FILTER_THRES_CH1 APB clock cycles in receive mode.
 */
#define RMT_RX_FILTER_THRES_CH0    0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_M  (RMT_RX_FILTER_THRES_CH0_V << RMT_RX_FILTER_THRES_CH0_S)
#define RMT_RX_FILTER_THRES_CH0_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_S  8
/** RMT_CHK_RX_CARRIER_EN_CH0 : R/W; bitpos: [16]; default: 0;
 *  Set this bit to enable memory loop read mode when carrier modulation is enabled for
 *  channel 1.
 */
#define RMT_CHK_RX_CARRIER_EN_CH0    (BIT(16))
#define RMT_CHK_RX_CARRIER_EN_CH0_M  (RMT_CHK_RX_CARRIER_EN_CH0_V << RMT_CHK_RX_CARRIER_EN_CH0_S)
#define RMT_CHK_RX_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CHK_RX_CARRIER_EN_CH0_S  16
/** RMT_REF_ALWAYS_ON_CH0 : R/W; bitpos: [17]; default: 0;
 *  Set this bit to select a base clock for channel 1.
 *
 *  1'h1: APB_CLK    1'h0: REF_TICK
 */
#define RMT_REF_ALWAYS_ON_CH0    (BIT(17))
#define RMT_REF_ALWAYS_ON_CH0_M  (RMT_REF_ALWAYS_ON_CH0_V << RMT_REF_ALWAYS_ON_CH0_S)
#define RMT_REF_ALWAYS_ON_CH0_V  0x00000001U
#define RMT_REF_ALWAYS_ON_CH0_S  17
/** RMT_IDLE_OUT_LV_CH0 : R/W; bitpos: [18]; default: 0;
 *  This bit configures the level of output signals in channel 1 when the transmitter
 *  is in idle state.
 */
#define RMT_IDLE_OUT_LV_CH0    (BIT(18))
#define RMT_IDLE_OUT_LV_CH0_M  (RMT_IDLE_OUT_LV_CH0_V << RMT_IDLE_OUT_LV_CH0_S)
#define RMT_IDLE_OUT_LV_CH0_V  0x00000001U
#define RMT_IDLE_OUT_LV_CH0_S  18
/** RMT_IDLE_OUT_EN_CH0 : R/W; bitpos: [19]; default: 0;
 *  This is the output enable bit for channel 1 in idle state.
 */
#define RMT_IDLE_OUT_EN_CH0    (BIT(19))
#define RMT_IDLE_OUT_EN_CH0_M  (RMT_IDLE_OUT_EN_CH0_V << RMT_IDLE_OUT_EN_CH0_S)
#define RMT_IDLE_OUT_EN_CH0_V  0x00000001U
#define RMT_IDLE_OUT_EN_CH0_S  19
/** RMT_TX_STOP_CH0 : R/W; bitpos: [20]; default: 0;
 *  Set this bit to stop the transmitter of channel 1 sending data out.
 */
#define RMT_TX_STOP_CH0    (BIT(20))
#define RMT_TX_STOP_CH0_M  (RMT_TX_STOP_CH0_V << RMT_TX_STOP_CH0_S)
#define RMT_TX_STOP_CH0_V  0x00000001U
#define RMT_TX_STOP_CH0_S  20

/** RMT_CH2CONF0_REG register
 *  Channel 2 configuration register 0
 */
#define RMT_CH2CONF0_REG (DR_REG_RMT_BASE + 0x20)
/** RMT_DIV_CNT_CH0 : R/W; bitpos: [7:0]; default: 2;
 *  This field is used to configure clock divider for channel 2.
 */
#define RMT_DIV_CNT_CH0    0x000000FFU
#define RMT_DIV_CNT_CH0_M  (RMT_DIV_CNT_CH0_V << RMT_DIV_CNT_CH0_S)
#define RMT_DIV_CNT_CH0_V  0x000000FFU
#define RMT_DIV_CNT_CH0_S  0
/** RMT_IDLE_THRES_CH0 : R/W; bitpos: [23:8]; default: 4096;
 *  Receiving ends when no edge is detected on input signals for continuous clock
 *  cycles longer than this field value.
 */
#define RMT_IDLE_THRES_CH0    0x0000FFFFU
#define RMT_IDLE_THRES_CH0_M  (RMT_IDLE_THRES_CH0_V << RMT_IDLE_THRES_CH0_S)
#define RMT_IDLE_THRES_CH0_V  0x0000FFFFU
#define RMT_IDLE_THRES_CH0_S  8
/** RMT_MEM_SIZE_CH0 : R/W; bitpos: [26:24]; default: 1;
 *  This field is used to configure the maximum blocks allocated to channel 2. The
 *  valid range is from 1 ~ 4-2.
 */
#define RMT_MEM_SIZE_CH0    0x00000007U
#define RMT_MEM_SIZE_CH0_M  (RMT_MEM_SIZE_CH0_V << RMT_MEM_SIZE_CH0_S)
#define RMT_MEM_SIZE_CH0_V  0x00000007U
#define RMT_MEM_SIZE_CH0_S  24
/** RMT_CARRIER_EFF_EN_CH0 : R/W; bitpos: [27]; default: 1;
 *  1: Add carrier modulation on output signals only at data sending state for channel
 *  2. 0: Add carrier modulation on signals at all states for channel 2. States here
 *  include idle state (ST_IDLE), reading data from RAM (ST_RD_MEM), and sending data
 *  stored in RAM (ST_SEND). Only valid when RMT_CARRIER_EN_CH2 is set to 1.
 */
#define RMT_CARRIER_EFF_EN_CH0    (BIT(27))
#define RMT_CARRIER_EFF_EN_CH0_M  (RMT_CARRIER_EFF_EN_CH0_V << RMT_CARRIER_EFF_EN_CH0_S)
#define RMT_CARRIER_EFF_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EFF_EN_CH0_S  27
/** RMT_CARRIER_EN_CH0 : R/W; bitpos: [28]; default: 1;
 *  This bit is used to enable carrier modulation for channel 2. 1: Add carrier
 *  modulation on output signals. 0: No carrier modulation is added on output signals.
 */
#define RMT_CARRIER_EN_CH0    (BIT(28))
#define RMT_CARRIER_EN_CH0_M  (RMT_CARRIER_EN_CH0_V << RMT_CARRIER_EN_CH0_S)
#define RMT_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CARRIER_EN_CH0_S  28
/** RMT_CARRIER_OUT_LV_CH0 : R/W; bitpos: [29]; default: 1;
 *  This bit is used to configure the position of carrier wave for channel 2.
 *
 *  1'h0: Add carrier wave on low-level output signals.
 *
 *  1'h1: Add carrier wave on high-level output signals.
 */
#define RMT_CARRIER_OUT_LV_CH0    (BIT(29))
#define RMT_CARRIER_OUT_LV_CH0_M  (RMT_CARRIER_OUT_LV_CH0_V << RMT_CARRIER_OUT_LV_CH0_S)
#define RMT_CARRIER_OUT_LV_CH0_V  0x00000001U
#define RMT_CARRIER_OUT_LV_CH0_S  29

