espressif/esp-idf/components/soc/esp32s2/include/soc/rmt_reg.h
/** RMT_CH3CONF1_REG register
 *  Channel 3 configuration register 1
 */
#define RMT_CH3CONF1_REG (DR_REG_RMT_BASE + 0x2c)
/** RMT_TX_START_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to start sending data on channel 3.
 */
#define RMT_TX_START_CH0    (BIT(0))
#define RMT_TX_START_CH0_M  (RMT_TX_START_CH0_V << RMT_TX_START_CH0_S)
#define RMT_TX_START_CH0_V  0x00000001U
#define RMT_TX_START_CH0_S  0
/** RMT_RX_EN_CH0 : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable receiver to receive data on channel 3.
 */
#define RMT_RX_EN_CH0    (BIT(1))
#define RMT_RX_EN_CH0_M  (RMT_RX_EN_CH0_V << RMT_RX_EN_CH0_S)
#define RMT_RX_EN_CH0_V  0x00000001U
#define RMT_RX_EN_CH0_S  1
/** RMT_MEM_WR_RST_CH0 : WO; bitpos: [2]; default: 0;
 *  Set this bit to reset RAM write address accessed by the receiver for channel 3.
 */
#define RMT_MEM_WR_RST_CH0    (BIT(2))
#define RMT_MEM_WR_RST_CH0_M  (RMT_MEM_WR_RST_CH0_V << RMT_MEM_WR_RST_CH0_S)
#define RMT_MEM_WR_RST_CH0_V  0x00000001U
#define RMT_MEM_WR_RST_CH0_S  2
/** RMT_MEM_RD_RST_CH0 : WO; bitpos: [3]; default: 0;
 *  Set this bit to reset RAM read address accessed by the transmitter for channel 3.
 */
#define RMT_MEM_RD_RST_CH0    (BIT(3))
#define RMT_MEM_RD_RST_CH0_M  (RMT_MEM_RD_RST_CH0_V << RMT_MEM_RD_RST_CH0_S)
#define RMT_MEM_RD_RST_CH0_V  0x00000001U
#define RMT_MEM_RD_RST_CH0_S  3
/** RMT_APB_MEM_RST_CH0 : WO; bitpos: [4]; default: 0;
 *  Set this bit to reset W/R ram address for channel 3 by accessing apb fifo.
 */
#define RMT_APB_MEM_RST_CH0    (BIT(4))
#define RMT_APB_MEM_RST_CH0_M  (RMT_APB_MEM_RST_CH0_V << RMT_APB_MEM_RST_CH0_S)
#define RMT_APB_MEM_RST_CH0_V  0x00000001U
#define RMT_APB_MEM_RST_CH0_S  4
/** RMT_MEM_OWNER_CH0 : R/W; bitpos: [5]; default: 1;
 *  This bit marks the ownership of channel 3's RAM block.
 *
 *  1'h1: Receiver is using the RAM.
 *
 *  1'h0: Transmitter is using the RAM.
 */
#define RMT_MEM_OWNER_CH0    (BIT(5))
#define RMT_MEM_OWNER_CH0_M  (RMT_MEM_OWNER_CH0_V << RMT_MEM_OWNER_CH0_S)
#define RMT_MEM_OWNER_CH0_V  0x00000001U
#define RMT_MEM_OWNER_CH0_S  5
/** RMT_TX_CONTI_MODE_CH0 : R/W; bitpos: [6]; default: 0;
 *  Set this bit to restart transmission in continuous node from the first data in
 *  channel 3.
 */
#define RMT_TX_CONTI_MODE_CH0    (BIT(6))
#define RMT_TX_CONTI_MODE_CH0_M  (RMT_TX_CONTI_MODE_CH0_V << RMT_TX_CONTI_MODE_CH0_S)
#define RMT_TX_CONTI_MODE_CH0_V  0x00000001U
#define RMT_TX_CONTI_MODE_CH0_S  6
/** RMT_RX_FILTER_EN_CH0 : R/W; bitpos: [7]; default: 0;
 *  Set this bit to enable the receiver's filter for channel 3.
 */
#define RMT_RX_FILTER_EN_CH0    (BIT(7))
#define RMT_RX_FILTER_EN_CH0_M  (RMT_RX_FILTER_EN_CH0_V << RMT_RX_FILTER_EN_CH0_S)
#define RMT_RX_FILTER_EN_CH0_V  0x00000001U
#define RMT_RX_FILTER_EN_CH0_S  7
/** RMT_RX_FILTER_THRES_CH0 : R/W; bitpos: [15:8]; default: 15;
 *  Set this field to ignore the input pulse when its width is less than
 *  RMT_RX_FILTER_THRES_CH3 APB clock cycles in receive mode.
 */
#define RMT_RX_FILTER_THRES_CH0    0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_M  (RMT_RX_FILTER_THRES_CH0_V << RMT_RX_FILTER_THRES_CH0_S)
#define RMT_RX_FILTER_THRES_CH0_V  0x000000FFU
#define RMT_RX_FILTER_THRES_CH0_S  8
/** RMT_CHK_RX_CARRIER_EN_CH0 : R/W; bitpos: [16]; default: 0;
 *  Set this bit to enable memory loop read mode when carrier modulation is enabled for
 *  channel 3.
 */
#define RMT_CHK_RX_CARRIER_EN_CH0    (BIT(16))
#define RMT_CHK_RX_CARRIER_EN_CH0_M  (RMT_CHK_RX_CARRIER_EN_CH0_V << RMT_CHK_RX_CARRIER_EN_CH0_S)
#define RMT_CHK_RX_CARRIER_EN_CH0_V  0x00000001U
#define RMT_CHK_RX_CARRIER_EN_CH0_S  16
/** RMT_REF_ALWAYS_ON_CH0 : R/W; bitpos: [17]; default: 0;
 *  Set this bit to select a base clock for channel 3.
 *
 *  1'h1: APB_CLK    1'h0: REF_TICK
 */
#define RMT_REF_ALWAYS_ON_CH0    (BIT(17))
#define RMT_REF_ALWAYS_ON_CH0_M  (RMT_REF_ALWAYS_ON_CH0_V << RMT_REF_ALWAYS_ON_CH0_S)
#define RMT_REF_ALWAYS_ON_CH0_V  0x00000001U
#define RMT_REF_ALWAYS_ON_CH0_S  17
/** RMT_IDLE_OUT_LV_CH0 : R/W; bitpos: [18]; default: 0;
 *  This bit configures the level of output signals in channel 3 when the transmitter
 *  is in idle state.
 */
#define RMT_IDLE_OUT_LV_CH0    (BIT(18))
#define RMT_IDLE_OUT_LV_CH0_M  (RMT_IDLE_OUT_LV_CH0_V << RMT_IDLE_OUT_LV_CH0_S)
#define RMT_IDLE_OUT_LV_CH0_V  0x00000001U
#define RMT_IDLE_OUT_LV_CH0_S  18
/** RMT_IDLE_OUT_EN_CH0 : R/W; bitpos: [19]; default: 0;
 *  This is the output enable bit for channel 3 in idle state.
 */
#define RMT_IDLE_OUT_EN_CH0    (BIT(19))
#define RMT_IDLE_OUT_EN_CH0_M  (RMT_IDLE_OUT_EN_CH0_V << RMT_IDLE_OUT_EN_CH0_S)
#define RMT_IDLE_OUT_EN_CH0_V  0x00000001U
#define RMT_IDLE_OUT_EN_CH0_S  19
/** RMT_TX_STOP_CH0 : R/W; bitpos: [20]; default: 0;
 *  Set this bit to stop the transmitter of channel 3 sending data out.
 */
#define RMT_TX_STOP_CH0    (BIT(20))
#define RMT_TX_STOP_CH0_M  (RMT_TX_STOP_CH0_V << RMT_TX_STOP_CH0_S)
#define RMT_TX_STOP_CH0_V  0x00000001U
#define RMT_TX_STOP_CH0_S  20

/** RMT_CH0STATUS_REG register
 *  Channel 0 status register
 */
#define RMT_CH0STATUS_REG (DR_REG_RMT_BASE + 0x30)
/** RMT_MEM_WADDR_EX_CH0 : RO; bitpos: [8:0]; default: 0;
 *  This field records the memory address offset when receiver of channel 0 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH0    0x000001FFU
#define RMT_MEM_WADDR_EX_CH0_M  (RMT_MEM_WADDR_EX_CH0_V << RMT_MEM_WADDR_EX_CH0_S)
#define RMT_MEM_WADDR_EX_CH0_V  0x000001FFU
#define RMT_MEM_WADDR_EX_CH0_S  0
/** RMT_MEM_RADDR_EX_CH0 : RO; bitpos: [18:10]; default: 0;
 *  This field records the memory address offset when transmitter of channel 0 is using
 *  the RAM.
 */
#define RMT_MEM_RADDR_EX_CH0    0x000001FFU
#define RMT_MEM_RADDR_EX_CH0_M  (RMT_MEM_RADDR_EX_CH0_V << RMT_MEM_RADDR_EX_CH0_S)
#define RMT_MEM_RADDR_EX_CH0_V  0x000001FFU
#define RMT_MEM_RADDR_EX_CH0_S  10
/** RMT_STATE_CH0 : RO; bitpos: [22:20]; default: 0;
 *  This field records the FSM status of channel 0.
 */
#define RMT_STATE_CH0    0x00000007U
#define RMT_STATE_CH0_M  (RMT_STATE_CH0_V << RMT_STATE_CH0_S)
#define RMT_STATE_CH0_V  0x00000007U
#define RMT_STATE_CH0_S  20
/** RMT_MEM_OWNER_ERR_CH0 : RO; bitpos: [23]; default: 0;
 *  This status bit will be set when the ownership of memory block is violated.
 */
#define RMT_MEM_OWNER_ERR_CH0    (BIT(23))
#define RMT_MEM_OWNER_ERR_CH0_M  (RMT_MEM_OWNER_ERR_CH0_V << RMT_MEM_OWNER_ERR_CH0_S)
#define RMT_MEM_OWNER_ERR_CH0_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH0_S  23
/** RMT_MEM_FULL_CH0 : RO; bitpos: [24]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory
 *  allows.
 */
#define RMT_MEM_FULL_CH0    (BIT(24))
#define RMT_MEM_FULL_CH0_M  (RMT_MEM_FULL_CH0_V << RMT_MEM_FULL_CH0_S)
#define RMT_MEM_FULL_CH0_V  0x00000001U
#define RMT_MEM_FULL_CH0_S  24
/** RMT_MEM_EMPTY_CH0 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be sent is more than memory allows and
 *  the wrap mode is disabled.
 */
#define RMT_MEM_EMPTY_CH0    (BIT(25))
#define RMT_MEM_EMPTY_CH0_M  (RMT_MEM_EMPTY_CH0_V << RMT_MEM_EMPTY_CH0_S)
#define RMT_MEM_EMPTY_CH0_V  0x00000001U
#define RMT_MEM_EMPTY_CH0_S  25
/** RMT_APB_MEM_WR_ERR_CH0 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  RAM via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH0    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH0_M  (RMT_APB_MEM_WR_ERR_CH0_V << RMT_APB_MEM_WR_ERR_CH0_S)
#define RMT_APB_MEM_WR_ERR_CH0_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH0_S  26
/** RMT_APB_MEM_RD_ERR_CH0 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads RAM
 *  via APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH0    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH0_M  (RMT_APB_MEM_RD_ERR_CH0_V << RMT_APB_MEM_RD_ERR_CH0_S)
#define RMT_APB_MEM_RD_ERR_CH0_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH0_S  27

/** RMT_CH1STATUS_REG register
 *  Channel 1 status register
 */
#define RMT_CH1STATUS_REG (DR_REG_RMT_BASE + 0x34)
/** RMT_MEM_WADDR_EX_CH0 : RO; bitpos: [8:0]; default: 0;
 *  This field records the memory address offset when receiver of channel 1 is using
 *  the RAM.
 */
#define RMT_MEM_WADDR_EX_CH0    0x000001FFU
#define RMT_MEM_WADDR_EX_CH0_M  (RMT_MEM_WADDR_EX_CH0_V << RMT_MEM_WADDR_EX_CH0_S)
#define RMT_MEM_WADDR_EX_CH0_V  0x000001FFU
#define RMT_MEM_WADDR_EX_CH0_S  0
/** RMT_MEM_RADDR_EX_CH0 : RO; bitpos: [18:10]; default: 0;
 *  This field records the memory address offset when transmitter of channel 1 is using
 *  the RAM.
 */
#define RMT_MEM_RADDR_EX_CH0    0x000001FFU
#define RMT_MEM_RADDR_EX_CH0_M  (RMT_MEM_RADDR_EX_CH0_V << RMT_MEM_RADDR_EX_CH0_S)
#define RMT_MEM_RADDR_EX_CH0_V  0x000001FFU
#define RMT_MEM_RADDR_EX_CH0_S  10
/** RMT_STATE_CH0 : RO; bitpos: [22:20]; default: 0;
 *  This field records the FSM status of channel 1.
 */
#define RMT_STATE_CH0    0x00000007U
#define RMT_STATE_CH0_M  (RMT_STATE_CH0_V << RMT_STATE_CH0_S)
#define RMT_STATE_CH0_V  0x00000007U
#define RMT_STATE_CH0_S  20
/** RMT_MEM_OWNER_ERR_CH0 : RO; bitpos: [23]; default: 0;
 *  This status bit will be set when the ownership of memory block is violated.
 */
#define RMT_MEM_OWNER_ERR_CH0    (BIT(23))
#define RMT_MEM_OWNER_ERR_CH0_M  (RMT_MEM_OWNER_ERR_CH0_V << RMT_MEM_OWNER_ERR_CH0_S)
#define RMT_MEM_OWNER_ERR_CH0_V  0x00000001U
#define RMT_MEM_OWNER_ERR_CH0_S  23
/** RMT_MEM_FULL_CH0 : RO; bitpos: [24]; default: 0;
 *  This status bit will be set if the receiver receives more data than the memory
 *  allows.
 */
#define RMT_MEM_FULL_CH0    (BIT(24))
#define RMT_MEM_FULL_CH0_M  (RMT_MEM_FULL_CH0_V << RMT_MEM_FULL_CH0_S)
#define RMT_MEM_FULL_CH0_V  0x00000001U
#define RMT_MEM_FULL_CH0_S  24
/** RMT_MEM_EMPTY_CH0 : RO; bitpos: [25]; default: 0;
 *  This status bit will be set when the data to be sent is more than memory allows and
 *  the wrap mode is disabled.
 */
#define RMT_MEM_EMPTY_CH0    (BIT(25))
#define RMT_MEM_EMPTY_CH0_M  (RMT_MEM_EMPTY_CH0_V << RMT_MEM_EMPTY_CH0_S)
#define RMT_MEM_EMPTY_CH0_V  0x00000001U
#define RMT_MEM_EMPTY_CH0_S  25
/** RMT_APB_MEM_WR_ERR_CH0 : RO; bitpos: [26]; default: 0;
 *  This status bit will be set if the offset address out of memory size when writes
 *  RAM via APB bus.
 */
#define RMT_APB_MEM_WR_ERR_CH0    (BIT(26))
#define RMT_APB_MEM_WR_ERR_CH0_M  (RMT_APB_MEM_WR_ERR_CH0_V << RMT_APB_MEM_WR_ERR_CH0_S)
#define RMT_APB_MEM_WR_ERR_CH0_V  0x00000001U
#define RMT_APB_MEM_WR_ERR_CH0_S  26
/** RMT_APB_MEM_RD_ERR_CH0 : RO; bitpos: [27]; default: 0;
 *  This status bit will be set if the offset address out of memory size when reads RAM
 *  via APB bus.
 */
#define RMT_APB_MEM_RD_ERR_CH0    (BIT(27))
#define RMT_APB_MEM_RD_ERR_CH0_M  (RMT_APB_MEM_RD_ERR_CH0_V << RMT_APB_MEM_RD_ERR_CH0_S)
#define RMT_APB_MEM_RD_ERR_CH0_V  0x00000001U
#define RMT_APB_MEM_RD_ERR_CH0_S  27

