espressif/esp-idf/components/soc/esp32s2/include/soc/rmt_reg.h
/** RMT_CH1ADDR_REG register
 *  Channel 1 address register
 */
#define RMT_CH1ADDR_REG (DR_REG_RMT_BASE + 0x44)
/** RMT_APB_MEM_WADDR_CH0 : RO; bitpos: [8:0]; default: 0;
 *  This field records the memory address offset when channel 1 writes RAM via APB bus.
 */
#define RMT_APB_MEM_WADDR_CH0    0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_M  (RMT_APB_MEM_WADDR_CH0_V << RMT_APB_MEM_WADDR_CH0_S)
#define RMT_APB_MEM_WADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_S  0
/** RMT_APB_MEM_RADDR_CH0 : RO; bitpos: [18:10]; default: 0;
 *  This field records the memory address offset when channel 1 reads RAM via APB bus.
 */
#define RMT_APB_MEM_RADDR_CH0    0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_M  (RMT_APB_MEM_RADDR_CH0_V << RMT_APB_MEM_RADDR_CH0_S)
#define RMT_APB_MEM_RADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_S  10

/** RMT_CH2ADDR_REG register
 *  Channel 2 address register
 */
#define RMT_CH2ADDR_REG (DR_REG_RMT_BASE + 0x48)
/** RMT_APB_MEM_WADDR_CH0 : RO; bitpos: [8:0]; default: 0;
 *  This field records the memory address offset when channel 2 writes RAM via APB bus.
 */
#define RMT_APB_MEM_WADDR_CH0    0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_M  (RMT_APB_MEM_WADDR_CH0_V << RMT_APB_MEM_WADDR_CH0_S)
#define RMT_APB_MEM_WADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_S  0
/** RMT_APB_MEM_RADDR_CH0 : RO; bitpos: [18:10]; default: 0;
 *  This field records the memory address offset when channel 2 reads RAM via APB bus.
 */
#define RMT_APB_MEM_RADDR_CH0    0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_M  (RMT_APB_MEM_RADDR_CH0_V << RMT_APB_MEM_RADDR_CH0_S)
#define RMT_APB_MEM_RADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_S  10

/** RMT_CH3ADDR_REG register
 *  Channel 3 address register
 */
#define RMT_CH3ADDR_REG (DR_REG_RMT_BASE + 0x4c)
/** RMT_APB_MEM_WADDR_CH0 : RO; bitpos: [8:0]; default: 0;
 *  This field records the memory address offset when channel 3 writes RAM via APB bus.
 */
#define RMT_APB_MEM_WADDR_CH0    0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_M  (RMT_APB_MEM_WADDR_CH0_V << RMT_APB_MEM_WADDR_CH0_S)
#define RMT_APB_MEM_WADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_WADDR_CH0_S  0
/** RMT_APB_MEM_RADDR_CH0 : RO; bitpos: [18:10]; default: 0;
 *  This field records the memory address offset when channel 3 reads RAM via APB bus.
 */
#define RMT_APB_MEM_RADDR_CH0    0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_M  (RMT_APB_MEM_RADDR_CH0_V << RMT_APB_MEM_RADDR_CH0_S)
#define RMT_APB_MEM_RADDR_CH0_V  0x000001FFU
#define RMT_APB_MEM_RADDR_CH0_S  10

/** RMT_INT_RAW_REG register
 *  Raw interrupt status register
 */
#define RMT_INT_RAW_REG (DR_REG_RMT_BASE + 0x50)
/** RMT_CH0_TX_END_INT_RAW : RO; bitpos: [0]; default: 0;
 *  The interrupt raw bit for channel 0. Triggered when transmitting ends.
 */
#define RMT_CH0_TX_END_INT_RAW    (BIT(0))
#define RMT_CH0_TX_END_INT_RAW_M  (RMT_CH0_TX_END_INT_RAW_V << RMT_CH0_TX_END_INT_RAW_S)
#define RMT_CH0_TX_END_INT_RAW_V  0x00000001U
#define RMT_CH0_TX_END_INT_RAW_S  0
/** RMT_CH0_RX_END_INT_RAW : RO; bitpos: [1]; default: 0;
 *  The interrupt raw bit for channel 0. Triggered when receiving ends.
 */
#define RMT_CH0_RX_END_INT_RAW    (BIT(1))
#define RMT_CH0_RX_END_INT_RAW_M  (RMT_CH0_RX_END_INT_RAW_V << RMT_CH0_RX_END_INT_RAW_S)
#define RMT_CH0_RX_END_INT_RAW_V  0x00000001U
#define RMT_CH0_RX_END_INT_RAW_S  1
/** RMT_CH0_ERR_INT_RAW : RO; bitpos: [2]; default: 0;
 *  The interrupt raw bit for channel 0. Triggered when error occurs.
 */
#define RMT_CH0_ERR_INT_RAW    (BIT(2))
#define RMT_CH0_ERR_INT_RAW_M  (RMT_CH0_ERR_INT_RAW_V << RMT_CH0_ERR_INT_RAW_S)
#define RMT_CH0_ERR_INT_RAW_V  0x00000001U
#define RMT_CH0_ERR_INT_RAW_S  2
/** RMT_CH1_TX_END_INT_RAW : RO; bitpos: [3]; default: 0;
 *  The interrupt raw bit for channel 1. Triggered when transmitting ends.
 */
#define RMT_CH1_TX_END_INT_RAW    (BIT(3))
#define RMT_CH1_TX_END_INT_RAW_M  (RMT_CH1_TX_END_INT_RAW_V << RMT_CH1_TX_END_INT_RAW_S)
#define RMT_CH1_TX_END_INT_RAW_V  0x00000001U
#define RMT_CH1_TX_END_INT_RAW_S  3
/** RMT_CH1_RX_END_INT_RAW : RO; bitpos: [4]; default: 0;
 *  The interrupt raw bit for channel 1. Triggered when receiving ends.
 */
#define RMT_CH1_RX_END_INT_RAW    (BIT(4))
#define RMT_CH1_RX_END_INT_RAW_M  (RMT_CH1_RX_END_INT_RAW_V << RMT_CH1_RX_END_INT_RAW_S)
#define RMT_CH1_RX_END_INT_RAW_V  0x00000001U
#define RMT_CH1_RX_END_INT_RAW_S  4
/** RMT_CH1_ERR_INT_RAW : RO; bitpos: [5]; default: 0;
 *  The interrupt raw bit for channel 1. Triggered when error occurs.
 */
#define RMT_CH1_ERR_INT_RAW    (BIT(5))
#define RMT_CH1_ERR_INT_RAW_M  (RMT_CH1_ERR_INT_RAW_V << RMT_CH1_ERR_INT_RAW_S)
#define RMT_CH1_ERR_INT_RAW_V  0x00000001U
#define RMT_CH1_ERR_INT_RAW_S  5
/** RMT_CH2_TX_END_INT_RAW : RO; bitpos: [6]; default: 0;
 *  The interrupt raw bit for channel 2. Triggered when transmitting ends.
 */
#define RMT_CH2_TX_END_INT_RAW    (BIT(6))
#define RMT_CH2_TX_END_INT_RAW_M  (RMT_CH2_TX_END_INT_RAW_V << RMT_CH2_TX_END_INT_RAW_S)
#define RMT_CH2_TX_END_INT_RAW_V  0x00000001U
#define RMT_CH2_TX_END_INT_RAW_S  6
/** RMT_CH2_RX_END_INT_RAW : RO; bitpos: [7]; default: 0;
 *  The interrupt raw bit for channel 2. Triggered when receiving ends.
 */
#define RMT_CH2_RX_END_INT_RAW    (BIT(7))
#define RMT_CH2_RX_END_INT_RAW_M  (RMT_CH2_RX_END_INT_RAW_V << RMT_CH2_RX_END_INT_RAW_S)
#define RMT_CH2_RX_END_INT_RAW_V  0x00000001U
#define RMT_CH2_RX_END_INT_RAW_S  7
/** RMT_CH2_ERR_INT_RAW : RO; bitpos: [8]; default: 0;
 *  The interrupt raw bit for channel 2. Triggered when error occurs.
 */
#define RMT_CH2_ERR_INT_RAW    (BIT(8))
#define RMT_CH2_ERR_INT_RAW_M  (RMT_CH2_ERR_INT_RAW_V << RMT_CH2_ERR_INT_RAW_S)
#define RMT_CH2_ERR_INT_RAW_V  0x00000001U
#define RMT_CH2_ERR_INT_RAW_S  8
/** RMT_CH3_TX_END_INT_RAW : RO; bitpos: [9]; default: 0;
 *  The interrupt raw bit for channel 3. Triggered when transmitting ends.
 */
#define RMT_CH3_TX_END_INT_RAW    (BIT(9))
#define RMT_CH3_TX_END_INT_RAW_M  (RMT_CH3_TX_END_INT_RAW_V << RMT_CH3_TX_END_INT_RAW_S)
#define RMT_CH3_TX_END_INT_RAW_V  0x00000001U
#define RMT_CH3_TX_END_INT_RAW_S  9
/** RMT_CH3_RX_END_INT_RAW : RO; bitpos: [10]; default: 0;
 *  The interrupt raw bit for channel 3. Triggered when receiving ends.
 */
#define RMT_CH3_RX_END_INT_RAW    (BIT(10))
#define RMT_CH3_RX_END_INT_RAW_M  (RMT_CH3_RX_END_INT_RAW_V << RMT_CH3_RX_END_INT_RAW_S)
#define RMT_CH3_RX_END_INT_RAW_V  0x00000001U
#define RMT_CH3_RX_END_INT_RAW_S  10
/** RMT_CH3_ERR_INT_RAW : RO; bitpos: [11]; default: 0;
 *  The interrupt raw bit for channel 3. Triggered when error occurs.
 */
#define RMT_CH3_ERR_INT_RAW    (BIT(11))
#define RMT_CH3_ERR_INT_RAW_M  (RMT_CH3_ERR_INT_RAW_V << RMT_CH3_ERR_INT_RAW_S)
#define RMT_CH3_ERR_INT_RAW_V  0x00000001U
#define RMT_CH3_ERR_INT_RAW_S  11
/** RMT_CH0_TX_THR_EVENT_INT_RAW : RO; bitpos: [12]; default: 0;
 *  The interrupt raw bit for channel 0. Triggered when transmitter sends more data
 *  than configured value.
 */
#define RMT_CH0_TX_THR_EVENT_INT_RAW    (BIT(12))
#define RMT_CH0_TX_THR_EVENT_INT_RAW_M  (RMT_CH0_TX_THR_EVENT_INT_RAW_V << RMT_CH0_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH0_TX_THR_EVENT_INT_RAW_V  0x00000001U
#define RMT_CH0_TX_THR_EVENT_INT_RAW_S  12
/** RMT_CH1_TX_THR_EVENT_INT_RAW : RO; bitpos: [13]; default: 0;
 *  The interrupt raw bit for channel 1. Triggered when transmitter sends more data
 *  than configured value.
 */
#define RMT_CH1_TX_THR_EVENT_INT_RAW    (BIT(13))
#define RMT_CH1_TX_THR_EVENT_INT_RAW_M  (RMT_CH1_TX_THR_EVENT_INT_RAW_V << RMT_CH1_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH1_TX_THR_EVENT_INT_RAW_V  0x00000001U
#define RMT_CH1_TX_THR_EVENT_INT_RAW_S  13
/** RMT_CH2_TX_THR_EVENT_INT_RAW : RO; bitpos: [14]; default: 0;
 *  The interrupt raw bit for channel 2. Triggered when transmitter sends more data
 *  than configured value.
 */
#define RMT_CH2_TX_THR_EVENT_INT_RAW    (BIT(14))
#define RMT_CH2_TX_THR_EVENT_INT_RAW_M  (RMT_CH2_TX_THR_EVENT_INT_RAW_V << RMT_CH2_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH2_TX_THR_EVENT_INT_RAW_V  0x00000001U
#define RMT_CH2_TX_THR_EVENT_INT_RAW_S  14
/** RMT_CH3_TX_THR_EVENT_INT_RAW : RO; bitpos: [15]; default: 0;
 *  The interrupt raw bit for channel 3. Triggered when transmitter sends more data
 *  than configured value.
 */
#define RMT_CH3_TX_THR_EVENT_INT_RAW    (BIT(15))
#define RMT_CH3_TX_THR_EVENT_INT_RAW_M  (RMT_CH3_TX_THR_EVENT_INT_RAW_V << RMT_CH3_TX_THR_EVENT_INT_RAW_S)
#define RMT_CH3_TX_THR_EVENT_INT_RAW_V  0x00000001U
#define RMT_CH3_TX_THR_EVENT_INT_RAW_S  15
/** RMT_CH0_TX_LOOP_INT_RAW : RO; bitpos: [16]; default: 0;
 *  The interrupt raw bit for channel 0. Triggered when loop counting reaches the
 *  configured threshold value.
 */
#define RMT_CH0_TX_LOOP_INT_RAW    (BIT(16))
#define RMT_CH0_TX_LOOP_INT_RAW_M  (RMT_CH0_TX_LOOP_INT_RAW_V << RMT_CH0_TX_LOOP_INT_RAW_S)
#define RMT_CH0_TX_LOOP_INT_RAW_V  0x00000001U
#define RMT_CH0_TX_LOOP_INT_RAW_S  16
/** RMT_CH1_TX_LOOP_INT_RAW : RO; bitpos: [17]; default: 0;
 *  The interrupt raw bit for channel 1. Triggered when loop counting reaches the
 *  configured threshold value.
 */
#define RMT_CH1_TX_LOOP_INT_RAW    (BIT(17))
#define RMT_CH1_TX_LOOP_INT_RAW_M  (RMT_CH1_TX_LOOP_INT_RAW_V << RMT_CH1_TX_LOOP_INT_RAW_S)
#define RMT_CH1_TX_LOOP_INT_RAW_V  0x00000001U
#define RMT_CH1_TX_LOOP_INT_RAW_S  17
/** RMT_CH2_TX_LOOP_INT_RAW : RO; bitpos: [18]; default: 0;
 *  The interrupt raw bit for channel 2. Triggered when loop counting reaches the
 *  configured threshold value.
 */
#define RMT_CH2_TX_LOOP_INT_RAW    (BIT(18))
#define RMT_CH2_TX_LOOP_INT_RAW_M  (RMT_CH2_TX_LOOP_INT_RAW_V << RMT_CH2_TX_LOOP_INT_RAW_S)
#define RMT_CH2_TX_LOOP_INT_RAW_V  0x00000001U
#define RMT_CH2_TX_LOOP_INT_RAW_S  18
/** RMT_CH3_TX_LOOP_INT_RAW : RO; bitpos: [19]; default: 0;
 *  The interrupt raw bit for channel 3. Triggered when loop counting reaches the
 *  configured threshold value.
 */
#define RMT_CH3_TX_LOOP_INT_RAW    (BIT(19))
#define RMT_CH3_TX_LOOP_INT_RAW_M  (RMT_CH3_TX_LOOP_INT_RAW_V << RMT_CH3_TX_LOOP_INT_RAW_S)
#define RMT_CH3_TX_LOOP_INT_RAW_V  0x00000001U
#define RMT_CH3_TX_LOOP_INT_RAW_S  19

/** RMT_INT_ST_REG register
 *  Masked interrupt status register
 */
#define RMT_INT_ST_REG (DR_REG_RMT_BASE + 0x54)
/** RMT_CH0_TX_END_INT_ST : RO; bitpos: [0]; default: 0;
 *  The masked interrupt status bit for RMT_CH0_TX_END_INT.
 */
#define RMT_CH0_TX_END_INT_ST    (BIT(0))
#define RMT_CH0_TX_END_INT_ST_M  (RMT_CH0_TX_END_INT_ST_V << RMT_CH0_TX_END_INT_ST_S)
#define RMT_CH0_TX_END_INT_ST_V  0x00000001U
#define RMT_CH0_TX_END_INT_ST_S  0
/** RMT_CH0_RX_END_INT_ST : RO; bitpos: [1]; default: 0;
 *  The masked interrupt status bit for RMT_CH0_RX_END_INT.
 */
#define RMT_CH0_RX_END_INT_ST    (BIT(1))
#define RMT_CH0_RX_END_INT_ST_M  (RMT_CH0_RX_END_INT_ST_V << RMT_CH0_RX_END_INT_ST_S)
#define RMT_CH0_RX_END_INT_ST_V  0x00000001U
#define RMT_CH0_RX_END_INT_ST_S  1
/** RMT_CH0_ERR_INT_ST : RO; bitpos: [2]; default: 0;
 *  The masked interrupt status bit for RMT_CH0_ERR_INT.
 */
#define RMT_CH0_ERR_INT_ST    (BIT(2))
#define RMT_CH0_ERR_INT_ST_M  (RMT_CH0_ERR_INT_ST_V << RMT_CH0_ERR_INT_ST_S)
#define RMT_CH0_ERR_INT_ST_V  0x00000001U
#define RMT_CH0_ERR_INT_ST_S  2
/** RMT_CH1_TX_END_INT_ST : RO; bitpos: [3]; default: 0;
 *  The masked interrupt status bit for RMT_CH1_TX_END_INT.
 */
#define RMT_CH1_TX_END_INT_ST    (BIT(3))
#define RMT_CH1_TX_END_INT_ST_M  (RMT_CH1_TX_END_INT_ST_V << RMT_CH1_TX_END_INT_ST_S)
#define RMT_CH1_TX_END_INT_ST_V  0x00000001U
#define RMT_CH1_TX_END_INT_ST_S  3
/** RMT_CH1_RX_END_INT_ST : RO; bitpos: [4]; default: 0;
 *  The masked interrupt status bit for RMT_CH1_RX_END_INT.
 */
#define RMT_CH1_RX_END_INT_ST    (BIT(4))
#define RMT_CH1_RX_END_INT_ST_M  (RMT_CH1_RX_END_INT_ST_V << RMT_CH1_RX_END_INT_ST_S)
#define RMT_CH1_RX_END_INT_ST_V  0x00000001U
#define RMT_CH1_RX_END_INT_ST_S  4
/** RMT_CH1_ERR_INT_ST : RO; bitpos: [5]; default: 0;
 *  The masked interrupt status bit for RMT_CH1_ERR_INT.
 */
#define RMT_CH1_ERR_INT_ST    (BIT(5))
#define RMT_CH1_ERR_INT_ST_M  (RMT_CH1_ERR_INT_ST_V << RMT_CH1_ERR_INT_ST_S)
#define RMT_CH1_ERR_INT_ST_V  0x00000001U
#define RMT_CH1_ERR_INT_ST_S  5
/** RMT_CH2_TX_END_INT_ST : RO; bitpos: [6]; default: 0;
 *  The masked interrupt status bit for RMT_CH2_TX_END_INT.
 */
#define RMT_CH2_TX_END_INT_ST    (BIT(6))
#define RMT_CH2_TX_END_INT_ST_M  (RMT_CH2_TX_END_INT_ST_V << RMT_CH2_TX_END_INT_ST_S)
#define RMT_CH2_TX_END_INT_ST_V  0x00000001U
#define RMT_CH2_TX_END_INT_ST_S  6
/** RMT_CH2_RX_END_INT_ST : RO; bitpos: [7]; default: 0;
 *  The masked interrupt status bit for RMT_CH2_RX_END_INT.
 */
#define RMT_CH2_RX_END_INT_ST    (BIT(7))
#define RMT_CH2_RX_END_INT_ST_M  (RMT_CH2_RX_END_INT_ST_V << RMT_CH2_RX_END_INT_ST_S)
#define RMT_CH2_RX_END_INT_ST_V  0x00000001U
#define RMT_CH2_RX_END_INT_ST_S  7
/** RMT_CH2_ERR_INT_ST : RO; bitpos: [8]; default: 0;
 *  The masked interrupt status bit for RMT_CH2_ERR_INT.
 */
#define RMT_CH2_ERR_INT_ST    (BIT(8))
#define RMT_CH2_ERR_INT_ST_M  (RMT_CH2_ERR_INT_ST_V << RMT_CH2_ERR_INT_ST_S)
#define RMT_CH2_ERR_INT_ST_V  0x00000001U
#define RMT_CH2_ERR_INT_ST_S  8
/** RMT_CH3_TX_END_INT_ST : RO; bitpos: [9]; default: 0;
 *  The masked interrupt status bit for RMT_CH3_TX_END_INT.
 */
#define RMT_CH3_TX_END_INT_ST    (BIT(9))
#define RMT_CH3_TX_END_INT_ST_M  (RMT_CH3_TX_END_INT_ST_V << RMT_CH3_TX_END_INT_ST_S)
#define RMT_CH3_TX_END_INT_ST_V  0x00000001U
#define RMT_CH3_TX_END_INT_ST_S  9
/** RMT_CH3_RX_END_INT_ST : RO; bitpos: [10]; default: 0;
 *  The masked interrupt status bit for RMT_CH3_RX_END_INT.
 */
#define RMT_CH3_RX_END_INT_ST    (BIT(10))
#define RMT_CH3_RX_END_INT_ST_M  (RMT_CH3_RX_END_INT_ST_V << RMT_CH3_RX_END_INT_ST_S)
#define RMT_CH3_RX_END_INT_ST_V  0x00000001U
#define RMT_CH3_RX_END_INT_ST_S  10
/** RMT_CH3_ERR_INT_ST : RO; bitpos: [11]; default: 0;
 *  The masked interrupt status bit for RMT_CH3_ERR_INT.
 */
#define RMT_CH3_ERR_INT_ST    (BIT(11))
#define RMT_CH3_ERR_INT_ST_M  (RMT_CH3_ERR_INT_ST_V << RMT_CH3_ERR_INT_ST_S)
#define RMT_CH3_ERR_INT_ST_V  0x00000001U
#define RMT_CH3_ERR_INT_ST_S  11
/** RMT_CH0_TX_THR_EVENT_INT_ST : RO; bitpos: [12]; default: 0;
 *  The masked interrupt status bit for RMT_CH0_TX_THR_EVENT_INT.
 */
#define RMT_CH0_TX_THR_EVENT_INT_ST    (BIT(12))
#define RMT_CH0_TX_THR_EVENT_INT_ST_M  (RMT_CH0_TX_THR_EVENT_INT_ST_V << RMT_CH0_TX_THR_EVENT_INT_ST_S)
#define RMT_CH0_TX_THR_EVENT_INT_ST_V  0x00000001U
#define RMT_CH0_TX_THR_EVENT_INT_ST_S  12
/** RMT_CH1_TX_THR_EVENT_INT_ST : RO; bitpos: [13]; default: 0;
 *  The masked interrupt status bit for RMT_CH1_TX_THR_EVENT_INT.
 */
#define RMT_CH1_TX_THR_EVENT_INT_ST    (BIT(13))
#define RMT_CH1_TX_THR_EVENT_INT_ST_M  (RMT_CH1_TX_THR_EVENT_INT_ST_V << RMT_CH1_TX_THR_EVENT_INT_ST_S)
#define RMT_CH1_TX_THR_EVENT_INT_ST_V  0x00000001U
#define RMT_CH1_TX_THR_EVENT_INT_ST_S  13
/** RMT_CH2_TX_THR_EVENT_INT_ST : RO; bitpos: [14]; default: 0;
 *  The masked interrupt status bit for RMT_CH2_TX_THR_EVENT_INT.
 */
#define RMT_CH2_TX_THR_EVENT_INT_ST    (BIT(14))
#define RMT_CH2_TX_THR_EVENT_INT_ST_M  (RMT_CH2_TX_THR_EVENT_INT_ST_V << RMT_CH2_TX_THR_EVENT_INT_ST_S)
#define RMT_CH2_TX_THR_EVENT_INT_ST_V  0x00000001U
#define RMT_CH2_TX_THR_EVENT_INT_ST_S  14
/** RMT_CH3_TX_THR_EVENT_INT_ST : RO; bitpos: [15]; default: 0;
 *  The masked interrupt status bit for RMT_CH3_TX_THR_EVENT_INT.
 */
#define RMT_CH3_TX_THR_EVENT_INT_ST    (BIT(15))
#define RMT_CH3_TX_THR_EVENT_INT_ST_M  (RMT_CH3_TX_THR_EVENT_INT_ST_V << RMT_CH3_TX_THR_EVENT_INT_ST_S)
#define RMT_CH3_TX_THR_EVENT_INT_ST_V  0x00000001U
#define RMT_CH3_TX_THR_EVENT_INT_ST_S  15
/** RMT_CH0_TX_LOOP_INT_ST : RO; bitpos: [16]; default: 0;
 *  The masked interrupt status bit for RMT_CH0_TX_LOOP_INT.
 */
#define RMT_CH0_TX_LOOP_INT_ST    (BIT(16))
#define RMT_CH0_TX_LOOP_INT_ST_M  (RMT_CH0_TX_LOOP_INT_ST_V << RMT_CH0_TX_LOOP_INT_ST_S)
#define RMT_CH0_TX_LOOP_INT_ST_V  0x00000001U
#define RMT_CH0_TX_LOOP_INT_ST_S  16
/** RMT_CH1_TX_LOOP_INT_ST : RO; bitpos: [17]; default: 0;
 *  The masked interrupt status bit for RMT_CH1_TX_LOOP_INT.
 */
#define RMT_CH1_TX_LOOP_INT_ST    (BIT(17))
#define RMT_CH1_TX_LOOP_INT_ST_M  (RMT_CH1_TX_LOOP_INT_ST_V << RMT_CH1_TX_LOOP_INT_ST_S)
#define RMT_CH1_TX_LOOP_INT_ST_V  0x00000001U
#define RMT_CH1_TX_LOOP_INT_ST_S  17
/** RMT_CH2_TX_LOOP_INT_ST : RO; bitpos: [18]; default: 0;
 *  The masked interrupt status bit for RMT_CH2_TX_LOOP_INT.
 */
#define RMT_CH2_TX_LOOP_INT_ST    (BIT(18))
#define RMT_CH2_TX_LOOP_INT_ST_M  (RMT_CH2_TX_LOOP_INT_ST_V << RMT_CH2_TX_LOOP_INT_ST_S)
#define RMT_CH2_TX_LOOP_INT_ST_V  0x00000001U
#define RMT_CH2_TX_LOOP_INT_ST_S  18
/** RMT_CH3_TX_LOOP_INT_ST : RO; bitpos: [19]; default: 0;
 *  The masked interrupt status bit for RMT_CH3_TX_LOOP_INT.
 */
#define RMT_CH3_TX_LOOP_INT_ST    (BIT(19))
#define RMT_CH3_TX_LOOP_INT_ST_M  (RMT_CH3_TX_LOOP_INT_ST_V << RMT_CH3_TX_LOOP_INT_ST_S)
#define RMT_CH3_TX_LOOP_INT_ST_V  0x00000001U
#define RMT_CH3_TX_LOOP_INT_ST_S  19

/** RMT_INT_ENA_REG register
 *  Interrupt enable register
 */
#define RMT_INT_ENA_REG (DR_REG_RMT_BASE + 0x58)
/** RMT_CH0_TX_END_INT_ENA : R/W; bitpos: [0]; default: 0;
 *  The interrupt enabled bit for RMT_CH0_TX_END_INT.
 */
#define RMT_CH0_TX_END_INT_ENA    (BIT(0))
#define RMT_CH0_TX_END_INT_ENA_M  (RMT_CH0_TX_END_INT_ENA_V << RMT_CH0_TX_END_INT_ENA_S)
#define RMT_CH0_TX_END_INT_ENA_V  0x00000001U
#define RMT_CH0_TX_END_INT_ENA_S  0
/** RMT_CH0_RX_END_INT_ENA : R/W; bitpos: [1]; default: 0;
 *  The interrupt enabled bit for RMT_CH0_RX_END_INT.
 */
#define RMT_CH0_RX_END_INT_ENA    (BIT(1))
#define RMT_CH0_RX_END_INT_ENA_M  (RMT_CH0_RX_END_INT_ENA_V << RMT_CH0_RX_END_INT_ENA_S)
#define RMT_CH0_RX_END_INT_ENA_V  0x00000001U
#define RMT_CH0_RX_END_INT_ENA_S  1
/** RMT_CH0_ERR_INT_ENA : R/W; bitpos: [2]; default: 0;
 *  The interrupt enabled bit for RMT_CH0_ERR_INT.
 */
#define RMT_CH0_ERR_INT_ENA    (BIT(2))
#define RMT_CH0_ERR_INT_ENA_M  (RMT_CH0_ERR_INT_ENA_V << RMT_CH0_ERR_INT_ENA_S)
#define RMT_CH0_ERR_INT_ENA_V  0x00000001U
#define RMT_CH0_ERR_INT_ENA_S  2
/** RMT_CH1_TX_END_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  The interrupt enabled bit for RMT_CH1_TX_END_INT.
 */
#define RMT_CH1_TX_END_INT_ENA    (BIT(3))
#define RMT_CH1_TX_END_INT_ENA_M  (RMT_CH1_TX_END_INT_ENA_V << RMT_CH1_TX_END_INT_ENA_S)
#define RMT_CH1_TX_END_INT_ENA_V  0x00000001U
#define RMT_CH1_TX_END_INT_ENA_S  3
/** RMT_CH1_RX_END_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  The interrupt enabled bit for RMT_CH1_RX_END_INT.
 */
#define RMT_CH1_RX_END_INT_ENA    (BIT(4))
#define RMT_CH1_RX_END_INT_ENA_M  (RMT_CH1_RX_END_INT_ENA_V << RMT_CH1_RX_END_INT_ENA_S)
#define RMT_CH1_RX_END_INT_ENA_V  0x00000001U
#define RMT_CH1_RX_END_INT_ENA_S  4
/** RMT_CH1_ERR_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  The interrupt enabled bit for RMT_CH1_ERR_INT.
 */
#define RMT_CH1_ERR_INT_ENA    (BIT(5))
#define RMT_CH1_ERR_INT_ENA_M  (RMT_CH1_ERR_INT_ENA_V << RMT_CH1_ERR_INT_ENA_S)
#define RMT_CH1_ERR_INT_ENA_V  0x00000001U
#define RMT_CH1_ERR_INT_ENA_S  5
/** RMT_CH2_TX_END_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  The interrupt enabled bit for RMT_CH2_TX_END_INT.
 */
#define RMT_CH2_TX_END_INT_ENA    (BIT(6))
#define RMT_CH2_TX_END_INT_ENA_M  (RMT_CH2_TX_END_INT_ENA_V << RMT_CH2_TX_END_INT_ENA_S)
#define RMT_CH2_TX_END_INT_ENA_V  0x00000001U
#define RMT_CH2_TX_END_INT_ENA_S  6
/** RMT_CH2_RX_END_INT_ENA : R/W; bitpos: [7]; default: 0;
 *  The interrupt enabled bit for RMT_CH2_RX_END_INT.
 */
#define RMT_CH2_RX_END_INT_ENA    (BIT(7))
#define RMT_CH2_RX_END_INT_ENA_M  (RMT_CH2_RX_END_INT_ENA_V << RMT_CH2_RX_END_INT_ENA_S)
#define RMT_CH2_RX_END_INT_ENA_V  0x00000001U
#define RMT_CH2_RX_END_INT_ENA_S  7
/** RMT_CH2_ERR_INT_ENA : R/W; bitpos: [8]; default: 0;
 *  The interrupt enabled bit for RMT_CH2_ERR_INT.
 */
#define RMT_CH2_ERR_INT_ENA    (BIT(8))
#define RMT_CH2_ERR_INT_ENA_M  (RMT_CH2_ERR_INT_ENA_V << RMT_CH2_ERR_INT_ENA_S)
#define RMT_CH2_ERR_INT_ENA_V  0x00000001U
#define RMT_CH2_ERR_INT_ENA_S  8
/** RMT_CH3_TX_END_INT_ENA : R/W; bitpos: [9]; default: 0;
 *  The interrupt enabled bit for RMT_CH3_TX_END_INT.
 */
#define RMT_CH3_TX_END_INT_ENA    (BIT(9))
#define RMT_CH3_TX_END_INT_ENA_M  (RMT_CH3_TX_END_INT_ENA_V << RMT_CH3_TX_END_INT_ENA_S)
#define RMT_CH3_TX_END_INT_ENA_V  0x00000001U
#define RMT_CH3_TX_END_INT_ENA_S  9
/** RMT_CH3_RX_END_INT_ENA : R/W; bitpos: [10]; default: 0;
 *  The interrupt enabled bit for RMT_CH3_RX_END_INT.
 */
#define RMT_CH3_RX_END_INT_ENA    (BIT(10))
#define RMT_CH3_RX_END_INT_ENA_M  (RMT_CH3_RX_END_INT_ENA_V << RMT_CH3_RX_END_INT_ENA_S)
#define RMT_CH3_RX_END_INT_ENA_V  0x00000001U
#define RMT_CH3_RX_END_INT_ENA_S  10
/** RMT_CH3_ERR_INT_ENA : R/W; bitpos: [11]; default: 0;
 *  The interrupt enabled bit for RMT_CH3_ERR_INT.
 */
#define RMT_CH3_ERR_INT_ENA    (BIT(11))
#define RMT_CH3_ERR_INT_ENA_M  (RMT_CH3_ERR_INT_ENA_V << RMT_CH3_ERR_INT_ENA_S)
#define RMT_CH3_ERR_INT_ENA_V  0x00000001U
#define RMT_CH3_ERR_INT_ENA_S  11
/** RMT_CH0_TX_THR_EVENT_INT_ENA : R/W; bitpos: [12]; default: 0;
 *  The interrupt enabled bit for RMT_CH0_TX_THR_EVENT_INT.
 */
#define RMT_CH0_TX_THR_EVENT_INT_ENA    (BIT(12))
#define RMT_CH0_TX_THR_EVENT_INT_ENA_M  (RMT_CH0_TX_THR_EVENT_INT_ENA_V << RMT_CH0_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH0_TX_THR_EVENT_INT_ENA_V  0x00000001U
#define RMT_CH0_TX_THR_EVENT_INT_ENA_S  12
/** RMT_CH1_TX_THR_EVENT_INT_ENA : R/W; bitpos: [13]; default: 0;
 *  The interrupt enabled bit for RMT_CH1_TX_THR_EVENT_INT.
 */
#define RMT_CH1_TX_THR_EVENT_INT_ENA    (BIT(13))
#define RMT_CH1_TX_THR_EVENT_INT_ENA_M  (RMT_CH1_TX_THR_EVENT_INT_ENA_V << RMT_CH1_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH1_TX_THR_EVENT_INT_ENA_V  0x00000001U
#define RMT_CH1_TX_THR_EVENT_INT_ENA_S  13
/** RMT_CH2_TX_THR_EVENT_INT_ENA : R/W; bitpos: [14]; default: 0;
 *  The interrupt enabled bit for RMT_CH2_TX_THR_EVENT_INT.
 */
#define RMT_CH2_TX_THR_EVENT_INT_ENA    (BIT(14))
#define RMT_CH2_TX_THR_EVENT_INT_ENA_M  (RMT_CH2_TX_THR_EVENT_INT_ENA_V << RMT_CH2_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH2_TX_THR_EVENT_INT_ENA_V  0x00000001U
#define RMT_CH2_TX_THR_EVENT_INT_ENA_S  14
/** RMT_CH3_TX_THR_EVENT_INT_ENA : R/W; bitpos: [15]; default: 0;
 *  The interrupt enabled bit for RMT_CH3_TX_THR_EVENT_INT.
 */
#define RMT_CH3_TX_THR_EVENT_INT_ENA    (BIT(15))
#define RMT_CH3_TX_THR_EVENT_INT_ENA_M  (RMT_CH3_TX_THR_EVENT_INT_ENA_V << RMT_CH3_TX_THR_EVENT_INT_ENA_S)
#define RMT_CH3_TX_THR_EVENT_INT_ENA_V  0x00000001U
#define RMT_CH3_TX_THR_EVENT_INT_ENA_S  15
/** RMT_CH0_TX_LOOP_INT_ENA : R/W; bitpos: [16]; default: 0;
 *  The interrupt enabled bit for RMT_CH0_TX_LOOP_INT.
 */
#define RMT_CH0_TX_LOOP_INT_ENA    (BIT(16))
#define RMT_CH0_TX_LOOP_INT_ENA_M  (RMT_CH0_TX_LOOP_INT_ENA_V << RMT_CH0_TX_LOOP_INT_ENA_S)
#define RMT_CH0_TX_LOOP_INT_ENA_V  0x00000001U
#define RMT_CH0_TX_LOOP_INT_ENA_S  16
/** RMT_CH1_TX_LOOP_INT_ENA : R/W; bitpos: [17]; default: 0;
 *  The interrupt enabled bit for RMT_CH1_TX_LOOP_INT.
 */
#define RMT_CH1_TX_LOOP_INT_ENA    (BIT(17))
#define RMT_CH1_TX_LOOP_INT_ENA_M  (RMT_CH1_TX_LOOP_INT_ENA_V << RMT_CH1_TX_LOOP_INT_ENA_S)
#define RMT_CH1_TX_LOOP_INT_ENA_V  0x00000001U
#define RMT_CH1_TX_LOOP_INT_ENA_S  17
/** RMT_CH2_TX_LOOP_INT_ENA : R/W; bitpos: [18]; default: 0;
 *  The interrupt enabled bit for RMT_CH2_TX_LOOP_INT.
 */
#define RMT_CH2_TX_LOOP_INT_ENA    (BIT(18))
#define RMT_CH2_TX_LOOP_INT_ENA_M  (RMT_CH2_TX_LOOP_INT_ENA_V << RMT_CH2_TX_LOOP_INT_ENA_S)
#define RMT_CH2_TX_LOOP_INT_ENA_V  0x00000001U
#define RMT_CH2_TX_LOOP_INT_ENA_S  18
/** RMT_CH3_TX_LOOP_INT_ENA : R/W; bitpos: [19]; default: 0;
 *  The interrupt enabled bit for RMT_CH3_TX_LOOP_INT.
 */
#define RMT_CH3_TX_LOOP_INT_ENA    (BIT(19))
#define RMT_CH3_TX_LOOP_INT_ENA_M  (RMT_CH3_TX_LOOP_INT_ENA_V << RMT_CH3_TX_LOOP_INT_ENA_S)
#define RMT_CH3_TX_LOOP_INT_ENA_V  0x00000001U
#define RMT_CH3_TX_LOOP_INT_ENA_S  19

