espressif/esp-idf/components/soc/esp32s2/include/soc/rmt_reg.h
/** RMT_APB_CONF_REG register
 *  RMT APB configuration register
 */
#define RMT_APB_CONF_REG (DR_REG_RMT_BASE + 0x80)
/** RMT_APB_FIFO_MASK : R/W; bitpos: [0]; default: 0;
 *  1'h1: Access memory directly.  1'h0: access memory via APB FIFO.
 */
#define RMT_APB_FIFO_MASK    (BIT(0))
#define RMT_APB_FIFO_MASK_M  (RMT_APB_FIFO_MASK_V << RMT_APB_FIFO_MASK_S)
#define RMT_APB_FIFO_MASK_V  0x00000001U
#define RMT_APB_FIFO_MASK_S  0
/** RMT_MEM_TX_WRAP_EN : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable wrap mode.
 */
#define RMT_MEM_TX_WRAP_EN    (BIT(1))
#define RMT_MEM_TX_WRAP_EN_M  (RMT_MEM_TX_WRAP_EN_V << RMT_MEM_TX_WRAP_EN_S)
#define RMT_MEM_TX_WRAP_EN_V  0x00000001U
#define RMT_MEM_TX_WRAP_EN_S  1
/** RMT_MEM_CLK_FORCE_ON : R/W; bitpos: [2]; default: 1;
 *  Set this bit to enable the clock for RAM when RMT module starts working, disable
 *  this clock when RMT stops working, to achieve low-power scheme.
 */
#define RMT_MEM_CLK_FORCE_ON    (BIT(2))
#define RMT_MEM_CLK_FORCE_ON_M  (RMT_MEM_CLK_FORCE_ON_V << RMT_MEM_CLK_FORCE_ON_S)
#define RMT_MEM_CLK_FORCE_ON_V  0x00000001U
#define RMT_MEM_CLK_FORCE_ON_S  2
/** RMT_MEM_FORCE_PD : R/W; bitpos: [3]; default: 0;
 *  Set this bit to power down RMT memory.
 */
#define RMT_MEM_FORCE_PD    (BIT(3))
#define RMT_MEM_FORCE_PD_M  (RMT_MEM_FORCE_PD_V << RMT_MEM_FORCE_PD_S)
#define RMT_MEM_FORCE_PD_V  0x00000001U
#define RMT_MEM_FORCE_PD_S  3
/** RMT_MEM_FORCE_PU : R/W; bitpos: [4]; default: 0;
 *  1: Disable RAM's Light-sleep power down function. 0: power down RMT RAM when RMT is
 *  in Light-sleep mode.
 */
#define RMT_MEM_FORCE_PU    (BIT(4))
#define RMT_MEM_FORCE_PU_M  (RMT_MEM_FORCE_PU_V << RMT_MEM_FORCE_PU_S)
#define RMT_MEM_FORCE_PU_V  0x00000001U
#define RMT_MEM_FORCE_PU_S  4
/** RMT_CLK_EN : R/W; bitpos: [31]; default: 0;
 *  Clock gating enable bit for RMT registers to achieve low-power scheme. 1: Power up
 *  drive clock for RMT registers. 0: Power down drive clock for RMT registers.
 */
#define RMT_CLK_EN    (BIT(31))
#define RMT_CLK_EN_M  (RMT_CLK_EN_V << RMT_CLK_EN_S)
#define RMT_CLK_EN_V  0x00000001U
#define RMT_CLK_EN_S  31

/** RMT_TX_SIM_REG register
 *  Enable RMT simultaneous transmission
 */
#define RMT_TX_SIM_REG (DR_REG_RMT_BASE + 0x84)
/** RMT_TX_SIM_CH0 : R/W; bitpos: [0]; default: 0;
 *  Set this bit to enable channel 0 to start sending data simultaneously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH0    (BIT(0))
#define RMT_TX_SIM_CH0_M  (RMT_TX_SIM_CH0_V << RMT_TX_SIM_CH0_S)
#define RMT_TX_SIM_CH0_V  0x00000001U
#define RMT_TX_SIM_CH0_S  0
/** RMT_TX_SIM_CH1 : R/W; bitpos: [1]; default: 0;
 *  Set this bit to enable channel 1 to start sending data simultaneously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH1    (BIT(1))
#define RMT_TX_SIM_CH1_M  (RMT_TX_SIM_CH1_V << RMT_TX_SIM_CH1_S)
#define RMT_TX_SIM_CH1_V  0x00000001U
#define RMT_TX_SIM_CH1_S  1
/** RMT_TX_SIM_CH2 : R/W; bitpos: [2]; default: 0;
 *  Set this bit to enable channel 2 to start sending data simultaneously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH2    (BIT(2))
#define RMT_TX_SIM_CH2_M  (RMT_TX_SIM_CH2_V << RMT_TX_SIM_CH2_S)
#define RMT_TX_SIM_CH2_V  0x00000001U
#define RMT_TX_SIM_CH2_S  2
/** RMT_TX_SIM_CH3 : R/W; bitpos: [3]; default: 0;
 *  Set this bit to enable channel 3 to start sending data simultaneously with other
 *  enabled channels.
 */
#define RMT_TX_SIM_CH3    (BIT(3))
#define RMT_TX_SIM_CH3_M  (RMT_TX_SIM_CH3_V << RMT_TX_SIM_CH3_S)
#define RMT_TX_SIM_CH3_V  0x00000001U
#define RMT_TX_SIM_CH3_S  3
/** RMT_TX_SIM_EN : R/W; bitpos: [4]; default: 0;
 *  This bit is used to enable multiple channels to start sending data simultaneously.
 */
#define RMT_TX_SIM_EN    (BIT(4))
#define RMT_TX_SIM_EN_M  (RMT_TX_SIM_EN_V << RMT_TX_SIM_EN_S)
#define RMT_TX_SIM_EN_V  0x00000001U
#define RMT_TX_SIM_EN_S  4

/** RMT_REF_CNT_RST_REG register
 *  RMT clock divider reset register
 */
#define RMT_REF_CNT_RST_REG (DR_REG_RMT_BASE + 0x88)
/** RMT_REF_CNT_RST_CH0 : R/W; bitpos: [0]; default: 0;
 *  This bit is used to reset the clock divider of channel 0.
 */
#define RMT_REF_CNT_RST_CH0    (BIT(0))
#define RMT_REF_CNT_RST_CH0_M  (RMT_REF_CNT_RST_CH0_V << RMT_REF_CNT_RST_CH0_S)
#define RMT_REF_CNT_RST_CH0_V  0x00000001U
#define RMT_REF_CNT_RST_CH0_S  0
/** RMT_REF_CNT_RST_CH1 : R/W; bitpos: [1]; default: 0;
 *  This bit is used to reset the clock divider of channel 1.
 */
#define RMT_REF_CNT_RST_CH1    (BIT(1))
#define RMT_REF_CNT_RST_CH1_M  (RMT_REF_CNT_RST_CH1_V << RMT_REF_CNT_RST_CH1_S)
#define RMT_REF_CNT_RST_CH1_V  0x00000001U
#define RMT_REF_CNT_RST_CH1_S  1
/** RMT_REF_CNT_RST_CH2 : R/W; bitpos: [2]; default: 0;
 *  This bit is used to reset the clock divider of channel 2.
 */
#define RMT_REF_CNT_RST_CH2    (BIT(2))
#define RMT_REF_CNT_RST_CH2_M  (RMT_REF_CNT_RST_CH2_V << RMT_REF_CNT_RST_CH2_S)
#define RMT_REF_CNT_RST_CH2_V  0x00000001U
#define RMT_REF_CNT_RST_CH2_S  2
/** RMT_REF_CNT_RST_CH3 : R/W; bitpos: [3]; default: 0;
 *  This bit is used to reset the clock divider of channel 3.
 */
#define RMT_REF_CNT_RST_CH3    (BIT(3))
#define RMT_REF_CNT_RST_CH3_M  (RMT_REF_CNT_RST_CH3_V << RMT_REF_CNT_RST_CH3_S)
#define RMT_REF_CNT_RST_CH3_V  0x00000001U
#define RMT_REF_CNT_RST_CH3_S  3

/** RMT_CH0_RX_CARRIER_RM_REG register
 *  Channel 0 carrier remove register
 */
#define RMT_CH0_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x8c)
/** RMT_CARRIER_LOW_THRES_CH0 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in carrier modulation mode is (RMT_CARRIER_LOW_THRES_CH0 + 1)
 *  clock cycles for channel 0.
 */
#define RMT_CARRIER_LOW_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_M  (RMT_CARRIER_LOW_THRES_CH0_V << RMT_CARRIER_LOW_THRES_CH0_S)
#define RMT_CARRIER_LOW_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_S  0
/** RMT_CARRIER_HIGH_THRES_CH0 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in carrier modulation mode is (RMT_CARRIER_HIGH_THRES_CH0 +
 *  1) clock cycles for channel 0.
 */
#define RMT_CARRIER_HIGH_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_M  (RMT_CARRIER_HIGH_THRES_CH0_V << RMT_CARRIER_HIGH_THRES_CH0_S)
#define RMT_CARRIER_HIGH_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_S  16

/** RMT_CH1_RX_CARRIER_RM_REG register
 *  Channel 1 carrier remove register
 */
#define RMT_CH1_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x90)
/** RMT_CARRIER_LOW_THRES_CH0 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in carrier modulation mode is (RMT_CARRIER_LOW_THRES_CH1 + 1)
 *  clock cycles for channel 1.
 */
#define RMT_CARRIER_LOW_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_M  (RMT_CARRIER_LOW_THRES_CH0_V << RMT_CARRIER_LOW_THRES_CH0_S)
#define RMT_CARRIER_LOW_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_S  0
/** RMT_CARRIER_HIGH_THRES_CH0 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in carrier modulation mode is (RMT_CARRIER_HIGH_THRES_CH1 +
 *  1) clock cycles for channel 1.
 */
#define RMT_CARRIER_HIGH_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_M  (RMT_CARRIER_HIGH_THRES_CH0_V << RMT_CARRIER_HIGH_THRES_CH0_S)
#define RMT_CARRIER_HIGH_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_S  16

/** RMT_CH2_RX_CARRIER_RM_REG register
 *  Channel 2 carrier remove register
 */
#define RMT_CH2_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x94)
/** RMT_CARRIER_LOW_THRES_CH0 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in carrier modulation mode is (RMT_CARRIER_LOW_THRES_CH2 + 1)
 *  clock cycles for channel 2.
 */
#define RMT_CARRIER_LOW_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_M  (RMT_CARRIER_LOW_THRES_CH0_V << RMT_CARRIER_LOW_THRES_CH0_S)
#define RMT_CARRIER_LOW_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_S  0
/** RMT_CARRIER_HIGH_THRES_CH0 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in carrier modulation mode is (RMT_CARRIER_HIGH_THRES_CH2 +
 *  1) clock cycles for channel 2.
 */
#define RMT_CARRIER_HIGH_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_M  (RMT_CARRIER_HIGH_THRES_CH0_V << RMT_CARRIER_HIGH_THRES_CH0_S)
#define RMT_CARRIER_HIGH_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_S  16

/** RMT_CH3_RX_CARRIER_RM_REG register
 *  Channel 3 carrier remove register
 */
#define RMT_CH3_RX_CARRIER_RM_REG (DR_REG_RMT_BASE + 0x98)
/** RMT_CARRIER_LOW_THRES_CH0 : R/W; bitpos: [15:0]; default: 0;
 *  The low level period in carrier modulation mode is (RMT_CARRIER_LOW_THRES_CH3 + 1)
 *  clock cycles for channel 3.
 */
#define RMT_CARRIER_LOW_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_M  (RMT_CARRIER_LOW_THRES_CH0_V << RMT_CARRIER_LOW_THRES_CH0_S)
#define RMT_CARRIER_LOW_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_LOW_THRES_CH0_S  0
/** RMT_CARRIER_HIGH_THRES_CH0 : R/W; bitpos: [31:16]; default: 0;
 *  The high level period in carrier modulation mode is (RMT_CARRIER_HIGH_THRES_CH3 +
 *  1) clock cycles for channel 3.
 */
#define RMT_CARRIER_HIGH_THRES_CH0    0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_M  (RMT_CARRIER_HIGH_THRES_CH0_V << RMT_CARRIER_HIGH_THRES_CH0_S)
#define RMT_CARRIER_HIGH_THRES_CH0_V  0x0000FFFFU
#define RMT_CARRIER_HIGH_THRES_CH0_S  16

/** RMT_DATE_REG register
 *  Version control register
 */
#define RMT_DATE_REG (DR_REG_RMT_BASE + 0xfc)
/** RMT_DATE : R/W; bitpos: [31:0]; default: 419898881;
 *  Version control register
 */
#define RMT_DATE    0xFFFFFFFFU
#define RMT_DATE_M  (RMT_DATE_V << RMT_DATE_S)
#define RMT_DATE_V  0xFFFFFFFFU
#define RMT_DATE_S  0

#ifdef __cplusplus
}
#endif
